# Rebar Bend Data Crank Offset Length 0 Property

Source: https://www.revitapidocs.com/2026/8114afb9-6087-2569-e94f-5dc890784b1a.htm

---

| Rebar Bend Data Crank Offset Length 0 Property |
| --- |

Identifies the crank offset length at the start.

The default value is 0\. A positive value means that there is a valid crank. If the value is 0 it means that there is no crank. If the value is negative it means that there is a crank with incorrect values.

**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double CrankOffsetLength0 { get; }
```

```
Public ReadOnly Property CrankOffsetLength0 As Double
	Get
```

```
public:
property double CrankOffsetLength0 {
	double get ();
}
```

```
member CrankOffsetLength0 : float with get
```

#### Property Value

Double See Also

#### Reference

RebarBendData Class Autodesk.Revit.DB.Structure Namespace